import copy, re

animals = ['питон', 'питон', 'кит', 'собака', 'питон', 'кит', 'кошка', 'горилла', 'кит', 'кошка', 'жираф', 'леопард', 'жираф', 'жираф', 'кошка',
           'горилла', 'жираф', 'жираф', 'кошка', 'жираф', 'кошка', 'кошка', 'собака', 'кит', 'жираф', 'леопард', 'жираф', 'собака', 'кит', 'кит',
           'кит', 'жираф', 'собака', 'собака', 'кит', 'питон', 'леопард', 'кошка', 'жираф', 'собака', 'кошка', 'жираф', 'кошка', 'собака', 'кит',
           'леопард', 'леопард', 'горилла', 'горилла', 'кит']

p = lambda x: print(x)
animals2 = copy.copy(animals)

animals = [x for x in animals if re.match('к|л', x)]  #comprehension

[p(i) for i in animals]


p('animals2')

animals2 = filter(lambda x: re.match('к|л', x), animals2) #filter

[p(i) for i in animals2]


