ratings = {'Секретные материалы': 0.9, 'Ведьмак': 0.95, 'Клан Сопрано': 0.8, '24': 0.75, 'Черное зеркало': 0.98,
           'Во все тяжкие': 0.85, 'Игра престолов': 0.87, 'Карточный домик': 0.82, 'Рик и Морти': 1}
shows = {'Секретные материалы': 'фантастика', 'Ведьмак': 'фэнтази', 'Клан Сопрано': 'криминал', '24': 'драма',
         'Черное зеркало': 'фантастика', 'Во все тяжкие': 'криминал', 'Игра престолов': 'фэнтази',
        'Карточный домик': 'драма', 'Рик и Морти': 'фантастика'}

def criticFunc(shows,ratings):

    overall_ratings = 0# общий рейтинг
    divisor = 0# число фильмов с жанром фантастика

    for key, value in shows.items():#
        if value == 'фантастика': # если у фильма жанр фантастика то

            divisor += 1#считает количество фильмов
            overall_ratings += ratings.get(key)# складывает рейтинги

    print(f"Средний рейтинг для жанра фантастика {overall_ratings / divisor}")

criticFunc(shows,ratings)