from lesson5_Task2_1 import genre_count as genre_count
from lesson5_Task2_1 import middle_rating as middle_rating

shows = {'Секретные материалы': 'фантастика', 'Ведьмак': 'фэнтази', 'Клан Сопрано': 'криминал', '24': 'драма',
         'Черное зеркало': 'фантастика', 'Во все тяжкие': 'криминал', 'Игра престолов': 'фэнтази',
        'Карточный домик': 'драма', 'Рик и Морти': 'фантастика'}
ratings = {'Секретные материалы': 0.9, 'Ведьмак': 0.95, 'Клан Сопрано': 0.8, '24': 0.75, 'Черное зеркало': 0.98,
           'Во все тяжкие': 0.85, 'Игра престолов': 0.87, 'Карточный домик': 0.82, 'Рик и Морти': 1}

print(genre_count(shows, 'драма'))
print(genre_count(shows, 'криминал'))

shows_list = {'Секретные материалы', 'Ведьмак', 'Клан Сопрано', '24', 'Черное зеркало'}
shows_list2 = {'Во все тяжкие', 'Игра престолов', 'Карточный домик', 'Рик и Морти'}

print(middle_rating(ratings, shows_list))
print(middle_rating(ratings, shows_list2))

